{
  "backend/main.mo": "Main Motoko actor implementing theme management, user customizations, photo uploads, and walk tracking with sessions, ratings, and aggregate statistics (steps, calories, distance, time).",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features for removing mountain/sunrise decorative background elements from Layout.tsx and index.css.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including components, pages, hooks, and utilities with focus on profile-aware backend integration and theme management.",
  "frontend/index.css": "Global Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "Main HTML entry point with PWA meta tags, manifest link, app icons, and module script loading for React application.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, display mode (standalone), theme colors, orientation, and icon references for 192x192 and 512x512 sizes.",
  "frontend/public/sw.js": "Service worker implementing cache-first strategy with precaching of app shell, runtime caching, old cache cleanup, and comprehensive error logging.",
  "frontend/scripts/validate-manifest.js": "Node.js validation script that checks manifest.json for required fields, validates icon array structure, and verifies all referenced icon files exist in the public directory.",
  "frontend/src/App.tsx": "Defines the application routing structure using TanStack Router with a root route for login and protected routes for all main pages (landing, walk tracking, transformation, stats, partner, settings, tasks, and exercise categories), wrapping each in error boundaries and theme/profile providers.",
  "frontend/src/components/CustomizationSettings.tsx": "Provides a settings UI for customizing font size, units, notifications, and background music preferences, fetching and saving customization data via React Query hooks with loading states and error handling.",
  "frontend/src/components/DailyWalkRatings.tsx": "Displays walk ratings grouped by date (Today, Yesterday, or specific dates) with star ratings and mood badges, handling loading states, errors, and empty states while processing timestamps from the backend.",
  "frontend/src/components/ErrorBoundary.tsx": "A React error boundary component that catches and displays errors with detailed information including component name, error message, and stack trace, providing options to retry or navigate home.",
  "frontend/src/components/Layout.tsx": "Main application layout component with a sticky header containing logo, profile switcher (user/girlfriend), hamburger navigation menu with all app routes, and logout functionality with click-outside-to-close behavior.",
  "frontend/src/components/MapView.tsx": "Renders a canvas-based map visualization of walking routes, plotting coordinates as a path with start point (green) and current position (orange/blue), automatically scaling to fit bounds with padding.",
  "frontend/src/components/PartnerTaskHistory.tsx": "Displays a partner's daily tasks with completion status, progress bar, and task categories. Fetches tasks using useTasksByProfile hook and shows loading/error states.",
  "frontend/src/components/PartnerWalkHistory.tsx": "Shows a partner's walk history grouped by date (Today, Yesterday, etc.) with walk metrics like steps, duration, and calories. Uses useWalksByProfile hook to fetch walk data.",
  "frontend/src/components/PartnerWalkRatings.tsx": "Displays walk ratings for a partner grouped by date, showing star ratings and walk types. Fetches ratings using useWalkRatingsByProfile hook.",
  "frontend/src/components/PhotoUploader.tsx": "Provides drag-and-drop and click-to-upload functionality for images, converts files to ExternalBlob format, and shows upload progress with preview.",
  "frontend/src/components/ProtectedRoute.tsx": "Authentication guard component that redirects unauthenticated users to login page. Shows loading spinner during Internet Identity initialization.",
  "frontend/src/components/RecommendedWalkCard.tsx": "Card component displaying recommended walk details with distance, time, calories, and difficulty. Includes actions to mark as favorite, complete with rating, and track walk.",
  "frontend/src/components/RewardSelector.tsx": "Modal component that displays a grid of selectable rewards (date night, sleepover, massage, etc.) with icons and descriptions, allowing users to choose and confirm a reward after completing tasks.",
  "frontend/src/components/TaskCompletionAnimation.tsx": "Full-screen celebration animation component that displays a trophy icon with pulsing effects and \"WELL DONE!\" message for 3 seconds when all tasks are completed.",
  "frontend/src/components/ThemeSelector.tsx": "Grid of theme selection buttons (Default, Energize, Ocean, Sunset, Forest) with color previews that allows users to switch between different color themes for the app.",
  "frontend/src/components/TransformationPreview.tsx": "Side-by-side image comparison component showing before/after fitness transformation photos with AI-generated projection label and month duration display.",
  "frontend/src/components/WalkRatingModal.tsx": "Dialog modal with 5-star rating interface for users to rate their walk experience after completing tracked or recommended walks.",
  "frontend/src/components/WalkStats.tsx": "Card component displaying real-time or completed walk statistics including distance, duration, steps, and calories with icon-decorated stat boxes.",
  "frontend/src/contexts/ProfileContext.tsx": "React context provider managing active profile state ('user' or 'girlfriend') with sessionStorage persistence for profile switching functionality.",
  "frontend/src/contexts/ThemeContext.tsx": "React context provider that loads, applies, and manages theme selection by fetching from backend actor and dynamically updating CSS custom properties for different color schemes.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout with AuthClient, including identity persistence, delegation validation, and configurable authentication options.",
  "frontend/src/hooks/useLocationTracking.ts": "Custom hook that tracks user location via geolocation API, calculates walk metrics (distance, steps, calories, duration) in real-time, and returns a WalkSession object when tracking stops.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating walk stats, tasks, exercises, customizations, and walk ratings, all integrated with the actor and profile context.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom OKLCH color variables for dark theme, utility classes for text/background/border colors, and animations for hamburger menu and hidden compliments.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrapping the main App component.",
  "frontend/src/pages/ExerciseCategoryPage.tsx": "Displays exercises filtered by category (Upper Body, Lower Body, Core, Cardio) with fallback default exercises, showing name, description, and instructions for each exercise.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero section, feature cards, and daily walk ratings. Implements scroll-based fade animations for hero elements and navigation buttons to walk/tasks pages.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity authentication. Displays FitTransform branding and redirects authenticated users to home.",
  "frontend/src/pages/PartnerPage.tsx": "Partner dashboard with profile toggle (user/girlfriend) displaying walk ratings, walk history, and task history for the selected profile.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with theme selector, customization options, and app info (version, platform). Includes a hidden compliment element.",
  "frontend/src/pages/StatsPage.tsx": "Statistics page displaying aggregate walk metrics (steps, calories, distance, time) in card grid layout with loading skeletons.",
  "frontend/src/pages/TasksPage.tsx": "Daily tasks page with progress tracking, task completion checkboxes, and reward selector. Shows completion animation when all tasks are finished.",
  "frontend/src/pages/TransformationPage.tsx": "React page component for AI photo transformation feature where users upload a photo, select training duration (1-12 months), and generate a simulated transformation preview with toast notifications.",
  "frontend/src/pages/WalkTrackingPage.tsx": "React page component for walk tracking with real-time GPS location tracking, map view, stats display, recommended walks based on current location, and walk rating modal with save functionality.",
  "frontend/src/utils/walkCalculations.ts": "Utility functions for walk metrics calculations including Haversine distance formula for GPS coordinates, step count estimation (0.762m stride), and calorie burn calculation (50 cal/km).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using CSS variables (OKLCH/HSL), Inter font family, custom animations for accordions, and plugins for animations and typography.",
  "project_state.json": "Project state metadata tracking version 33 of a fitness app with Internet Identity auth, daily tasks, walk tracking, AI photo transformation, partner viewing, and dark grey/neon pink color scheme."
}