{
  "backend/main.mo": "Main Motoko backend actor providing theme management (default/dark themes with color customization), photo upload handling, and walk tracking functionality (storing sessions with steps, calories, distance, duration per user).",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: landing page with motivational message, customizable color themes, AI photo transformation, real-time walk tracking with map, and calorie/step calculation with associated files and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, theme management, walk tracking, photo transformation, statistics display, and utility functions.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system variables for light and dark modes, including primary, secondary, accent, muted, destructive, and chart colors with sidebar theming.",
  "frontend/index.html": "HTML entry point with viewport meta tag, 'Fitness App' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component setting up TanStack Router with five routes (landing, walk, transform, stats, settings) wrapped in ThemeProvider for global theme management.",
  "frontend/src/components/Layout.tsx": "Application layout with sticky header navigation (desktop menu and mobile icon buttons), main content outlet, and footer with social links and caffeine.ai attribution.",
  "frontend/src/components/MapView.tsx": "Canvas-based map component rendering walking routes by drawing coordinate paths with start marker (green), current position indicator (orange/blue), and tracking animation pulse effect.",
  "frontend/src/components/PhotoUploader.tsx": "React component for uploading photos with drag-and-drop support, preview display, and progress tracking. Converts uploaded files to ExternalBlob format and passes them to a callback handler.",
  "frontend/src/components/ThemeSelector.tsx": "Theme selection UI component displaying predefined color themes (Default, Energize, Ocean, Sunset, Forest) with visual color swatches and active state indicators. Uses ThemeContext to manage theme changes.",
  "frontend/src/components/TransformationPreview.tsx": "Displays before/after comparison of fitness transformation photos with original and AI-generated images side-by-side. Shows projected transformation timeline and AI-generated badge.",
  "frontend/src/components/WalkStats.tsx": "Dashboard component displaying real-time walking statistics including distance, duration, steps, and calories burned. Shows animated tracking indicator when actively recording.",
  "frontend/src/contexts/ThemeContext.tsx": "React context provider for managing application themes, fetching current theme from backend actor, and applying CSS custom properties to the document root based on selected theme.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages backend actor instances with authentication support, automatically recreating actors when identity changes and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with AuthClient integration.",
  "frontend/src/hooks/useLocationTracking.ts": "Custom hook for GPS-based walk tracking using browser geolocation API, calculating real-time distance, steps, calories, and duration. Returns WalkSession data when tracking stops.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching walk statistics (walks, steps, calories) and mutations for saving walks and uploading photos using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including primary, secondary, accent, and chart colors.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/LandingPage.tsx": "Hero landing page with fitness-themed background, call-to-action buttons for tracking walks and viewing transformations, and a features section highlighting app capabilities.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page displaying theme selector and app information with version number.",
  "frontend/src/pages/StatsPage.tsx": "Displays aggregate fitness statistics including total steps, calories, distance, and time with formatted metric cards and walk history.",
  "frontend/src/pages/TransformationPage.tsx": "Photo transformation page allowing users to upload photos, select training duration, and generate AI-powered body transformation previews.",
  "frontend/src/pages/WalkTrackingPage.tsx": "Real-time walk tracking page with start/stop controls, map view showing route, and live statistics display for distance, duration, steps, and calories.",
  "frontend/src/utils/walkCalculations.ts": "Utility functions for calculating distance between GPS coordinates using Haversine formula, estimating steps from distance, and calculating calories burned.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color themes using OKLCH color space, extended typography, container queries, animations, custom border radius, font families (Inter), and keyframe animations for accordion components.",
  "project_state.json": "Project state file for a fitness app tracking six existing features including motivational landing page, customizable themes, AI photo transformation, location tracking for walks with calories/steps calculation, and four pending feature requests."
}