{
  "backend/main.mo": "Main backend actor implementing theme management (default/dark themes), user customizations (font size, background music), photo uploads via blob storage, walk tracking with sessions (steps, calories, distance, duration), and daily task management with categories and exercises.",
  "backend/migration.mo": "Migration module defining old and new actor state types and a run function that preserves existing walkData and userThemes while initializing new empty maps for taskData, categoryMap, customizations, and nextTaskId during canister upgrades.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features: personalized landing message with fade animation, hidden compliments across pages, hero image removal, theme switcher fix, and tasks tab creation with daily fitness challenges.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including App.tsx with routing, ThemeContext with OKLCH colors, Layout with navigation, all page components (Landing, Walk, Transform, Stats, Settings, Tasks, Exercise categories), custom hooks for queries and location tracking, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including background, foreground, primary, secondary, accent, destructive, border, and chart colors.",
  "frontend/index.html": "Basic HTML entry point with UTF-8 charset, viewport meta tag, 'Fitness App' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with public login route and protected routes (landing, walk, transform, stats, settings, tasks, four exercise categories) wrapped in ThemeProvider and ProtectedRoute components.",
  "frontend/src/components/CustomizationSettings.tsx": "Settings component managing user preferences including font size (small/medium/large), units (metric/imperial), notifications toggle, and background music selection with backend persistence via useCustomizations and useSetCustomizations hooks.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header navigation, sidebar menu for desktop/mobile, social media links in footer, and user authentication dropdown with logout functionality. Includes decorative background elements and routing for home, walk tracking, transform, stats, exercises, tasks, and settings pages.",
  "frontend/src/components/MapView.tsx": "Canvas-based map visualization component that renders a walking route from GPS coordinates, displaying the path with start/end markers and current position indicator. Automatically scales and centers the route with padding.",
  "frontend/src/components/PhotoUploader.tsx": "Drag-and-drop photo upload component with file preview, progress tracking, and conversion to ExternalBlob format. Supports click-to-browse and validates image file types.",
  "frontend/src/components/ProtectedRoute.tsx": "Authentication wrapper component that redirects unauthenticated users to login page and shows loading spinner during identity initialization. Only renders children when user is authenticated.",
  "frontend/src/components/RewardSelector.tsx": "Modal component displaying selectable reward options (date night, massage, movie night, etc.) with icons and descriptions. Shows after completing all tasks and confirms selection with toast notification.",
  "frontend/src/components/TaskCompletionAnimation.tsx": "Celebratory full-screen animation overlay with trophy icon, pulsing rings, and \"WELL DONE\" message that auto-dismisses after 3 seconds when all tasks are completed.",
  "frontend/src/components/ThemeSelector.tsx": "Theme selection UI component displaying available color themes (Default, Energize, Ocean, Sunset, Forest) with color swatches and descriptions. Integrates with ThemeContext to persist theme changes.",
  "frontend/src/components/TransformationPreview.tsx": "React component that displays a before/after comparison of fitness transformation photos with AI-generated preview, showing original and transformed images side-by-side with month duration label.",
  "frontend/src/components/WalkStats.tsx": "React component that displays walking activity statistics (distance, duration, steps, calories) in a card layout with icons, showing real-time tracking status with animated indicator when active.",
  "frontend/src/contexts/ThemeContext.tsx": "React context provider that manages theme selection and application, supporting multiple color schemes (Energize, Ocean, Sunset, Forest) by dynamically updating CSS custom properties on the document root.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Custom React hook and provider for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication state using @dfinity/auth-client.",
  "frontend/src/hooks/useLocationTracking.ts": "Custom React hook that tracks user location during walks using the Geolocation API, calculating real-time distance, steps, calories, and duration, returning a WalkSession object when tracking stops.",
  "frontend/src/hooks/useQueries.ts": "Collection of custom React Query hooks for fetching and mutating backend data including walk statistics, photo uploads, daily tasks, exercises by category, and user customizations.",
  "frontend/src/index.css": "Global CSS file that imports Tailwind directives, defines CSS custom properties for light/dark themes using OKLCH color space, and includes custom utility classes for decorative backgrounds, hidden compliments, animations, and color utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/pages/ExerciseCategoryPage.tsx": "Displays exercises for a specific category (Upper Body, Lower Body, Core, Cardio) by fetching from backend via useExercisesByCategory hook, with fallback to hardcoded default exercises including names, descriptions, and instructions.",
  "frontend/src/pages/LandingPage.tsx": "Hero landing page with personalized message that fades on scroll, gradient hero section with call-to-action buttons for tracking and transformation features, and a features section showcasing app capabilities.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page that uses Internet Identity for secure login via passkey/email/phone, displays loading states, handles login errors, and redirects authenticated users to home.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with cards for theme selection (ThemeSelector component), customization options (CustomizationSettings component), and app information including version number.",
  "frontend/src/pages/StatsPage.tsx": "Displays aggregated fitness statistics including total steps, calories burned, distance traveled, and total time from walk data fetched via useWalkStats hook, with loading skeletons and formatted metric displays.",
  "frontend/src/pages/TasksPage.tsx": "Daily tasks page with progress tracking, task completion checkboxes, completion animations, and reward selector integration. Tasks cannot be unchecked once completed.",
  "frontend/src/pages/TransformationPage.tsx": "AI photo transformation page where users upload photos and select training duration (1-12 months) to generate a simulated future transformation image.",
  "frontend/src/pages/WalkTrackingPage.tsx": "Walk tracking page with start/stop controls, real-time map view, and stats display for distance, duration, steps, and calories using location tracking hook.",
  "frontend/src/utils/walkCalculations.ts": "Utility functions for calculating walk metrics: haversine distance between coordinates, step count from distance, and calories burned from distance and duration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using CSS variables (HSL/OKLCH), container settings, Inter font, and accordion animations with tailwindcss-animate plugin.",
  "project_state.json": "Project state tracking document listing implemented features including Internet Identity auth, daily tasks with rewards, AI transformation, walk tracking, themes, and a known issue with the color theme switcher."
}