{
  "backend/main.mo": "Main backend actor implementing theme management (default/dark themes with color settings), photo upload placeholder, and walk tracking functionality (storing sessions with steps, calories, distance, duration per user).",
  "feature_evidence.json": "Feature evidence report documenting implemented features including Internet Identity authentication gate, decorative background elements, landing page quote update, image removal, and decorative asset generation with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files describing routing, theme management, pages (landing, walk tracking, transformation, stats, settings), components (layout, photo uploader, map view), hooks, and styling configuration.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including primary, secondary, accent, muted, destructive colors and sidebar theming.",
  "frontend/index.html": "HTML entry point with basic meta tags, 'Fitness App' title, root div, and script tag loading the React application from main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with public login route and protected routes (landing, walk, transform, stats, settings) wrapped in ThemeProvider and ProtectedRoute components.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation, responsive desktop/mobile menus, logout button, decorative background elements (weights/nature), footer with social links and caffeine.ai attribution, and router Outlet.",
  "frontend/src/components/MapView.tsx": "Renders a canvas-based map visualization that displays GPS coordinates as a route with start/end markers. Supports real-time tracking with animated indicators and auto-scales to fit all coordinates with padding.",
  "frontend/src/components/PhotoUploader.tsx": "Provides drag-and-drop and click-to-upload photo functionality with preview and progress tracking. Converts uploaded files to ExternalBlob format and reports upload progress.",
  "frontend/src/components/ProtectedRoute.tsx": "Authentication guard component that redirects unauthenticated or anonymous users to the login page. Shows a loading spinner during identity initialization.",
  "frontend/src/components/ThemeSelector.tsx": "Displays a grid of theme options with color previews and allows users to select and apply different visual themes. Shows active theme with a checkmark indicator.",
  "frontend/src/components/TransformationPreview.tsx": "Shows before/after photo comparison for fitness transformations with AI-generated results. Displays original and transformed photos side-by-side with month duration label.",
  "frontend/src/components/WalkStats.tsx": "Displays walking activity statistics including distance, duration, steps, and calories in a card layout. Shows animated tracking indicator when actively recording.",
  "frontend/src/contexts/ThemeContext.tsx": "Provides theme management context that fetches, applies, and persists theme selections via the backend actor. Dynamically updates CSS custom properties based on selected theme.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with proper authentication using Internet Identity. Automatically invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLocationTracking.ts": "Custom hook that uses browser geolocation API to track walking sessions in real-time, calculating distance, steps, calories, and duration, returning a WalkSession object when stopped.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching walk statistics (walks, steps, calories) and mutations for saving walks and uploading photos via the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes, decorative background elements with fixed positioning, and responsive media queries for mobile devices.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/LandingPage.tsx": "Hero landing page with gradient text headings, call-to-action buttons for tracking walks and viewing transformations, and a features section showcasing app capabilities.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page that triggers Internet Identity login flow, displays loading states, handles errors, and redirects authenticated users to home.",
  "frontend/src/pages/SettingsPage.tsx": "Settings page with theme selector component and app information card displaying version and description.",
  "frontend/src/pages/StatsPage.tsx": "Displays user fitness statistics including total steps, calories burned, distance, and duration using cards with gradient backgrounds and icons. Fetches walk data via useWalkStats hook and formats metrics for display.",
  "frontend/src/pages/TransformationPage.tsx": "Provides AI photo transformation feature where users upload a photo, select training duration (1-12 months), and generate a simulated transformation preview. Currently uses a mock transformation with 2-second delay.",
  "frontend/src/pages/WalkTrackingPage.tsx": "Real-time walk tracking page with start/stop controls, displaying an interactive map of the route and live statistics (distance, duration, steps, calories). Saves completed walks to backend.",
  "frontend/src/utils/walkCalculations.ts": "Utility functions for calculating walk metrics: haversine distance between coordinates, step count from distance (using 0.762m stride), and calories burned (50 cal/km approximation).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color system using OKLCH color space, extended theme with sidebar/chart colors, custom border radius variables, Inter font family, and animation keyframes for accordions and carousels.",
  "project_state.json": "Project metadata tracking implemented features including landing page, theme customization, AI photo transformation, location tracking, Internet Identity authentication, and decorative background elements with transparent imagery requirements."
}